postman/collections/API-Styles.json

{
	"info": {
		"_postman_id": "0709c5b3-78b1-46ea-aedb-632384d78a41",
		"name": "API-Styles",
		"schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json",
		"_uid": "656799-0709c5b3-78b1-46ea-aedb-632384d78a41"
	},
	"item": [
		{
			"name": "SOAP",
			"item": [
				{
					"name": "Celsius to Farenheit Conversion",
					"id": "bc55952c-3d77-48c3-a22b-c248ed9c9140",
					"protocolProfileBehavior": {
						"disableBodyPruning": true,
						"disabledSystemHeaders": {}
					},
					"request": {
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "application/soap+xml; charset=utf-8",
								"type": "text"
							},
							{
								"key": "SOAPAction",
								"value": "\"#POST\"",
								"type": "text"
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n    <soap12:Body>\n        <CelsiusToFahrenheit xmlns=\"https://www.w3schools.com/xml/\">\n            <Celsius>30</Celsius>\n        </CelsiusToFahrenheit>\n    </soap12:Body>\n</soap12:Envelope>",
							"options": {
								"raw": {
									"language": "xml"
								}
							}
						},
						"url": {
							"raw": "https://www.w3schools.com/xml/tempconvert.asmx",
							"protocol": "https",
							"host": [
								"www",
								"w3schools",
								"com"
							],
							"path": [
								"xml",
								"tempconvert.asmx"
							]
						}
					},
					"response": []
				}
			],
			"id": "2784ac4d-910f-421e-b6ef-b222cd6d9d13",
			"description": "Test SOAP endpoint"
		}
	]
}